/*
    Author: Zinelis Christos

    Περιγραφή:

        Αρχείο που περιέχει συναρτήσεις υπολογισμού της πυκνότητας ενός στερεού.
        Οι συναρτήσεις αυτές θα χρησιμοποιηθούν στην κατασκευή ενός υπολογιστή
        σε μορφή ιστοσελίδας όπου ο χρήστης μπορεί να εισαγάγει τιμές σε πεδία εισόδου
        και να υπολογίζει την πυκνόητητα, τη μάζα ή τον όγκο, ανάλογα με τις γνωστές παραμέτρους που έχει στη διάθεσή του.
*/
// συνάρτηση υπολογισμού της πυκνότητας με γνωστά τη μάζα και τον όγκο
function Dens_D(M,V,units) {
    // δήλωσε μία μεταβλητή που θα κρατά την πυκνότητα και αρχικοποίησέ τη σε 0
    let D = 0;
    // στην περίπτωση που η παράμετρος V δεν είναι 0 τότε
    if (V != 0)
        D = M/V;    // υπολόγισε την τιμή της πυκνότητας

    // άν πρέπει να εμφανίσουμε μονάδες μέτρησης στο αποτέλεσμα
    if (units == true)
        D = D + " kg/m³ ";   // μορφοποίησε το αποτέλεσμα σε μορφή συμβολοσειράς με μονάδα μέτρησης

    return D;       // επέστρεψε την τιμή της πυκνότητας
}        
// συνάρτηση υπολογισμού της μάζας με γνωστά την πυκνότητα και τον όγκο
function Dens_M(D,V,units) {

    // δήλωσε μια μεταβλητή που θα κρατά το αποτέλεσμα
    let M = D * V;   // υπολόγισε το αποτέλεσμα της μάζας

    // άν πρέπει να εμφανίσουμε μονάδες μέτρησης στο αποτέλεσμα 
    if (units == true)
        M = M + " kg "; // μορφοποίησε το αποτέλεσμα σε μορφή συμβολοσειράς με μονάδα μέτρησης

    return M;    // επέστρεψε το αποτέλεσμα
}
// συνάρτηση υπολογισμού του όγκου με γνωστά τη μάζα και την πυκνότητα
function Dens_V(M,D,units) {
    // δήλωσε μία μεταβλητή που θα κρατά την τιμή του όγκου
    let V = 0;
    // άν η παράμετρος P δέν έχει την τιμή 0
    if (D != 0)
        V = M/D;  // υπολόγισε τον όγκο απο τις παραμέτρους

    // άν πρέπει να εμφανίσουμε μονάδες μέτρησης στο αποτέλεσμα 
    if (units == true)
        V = V + " m³ "; // μορφοποίησε το αποτέλεσμα σε μορφή συμβολοσειράς με μονάδα μέτρησης
    
    return V;  // επέστρεψε την τιμή του όγκου
}